Tekla.Structures.Dialog.UIControls.OrganizerDialog
The OrganizerDialog class represents a "template" of an organizer dialog.

Tekla.Structures.Dialog.UIControls.OrganizerDialog.#ctor
Initializes a new instance of the OrganizerDialog class.

Tekla.Structures.Dialog.UIControls.OrganizerDialog.OnLoad(System.EventArgs)
The organizer dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.OrganizerDialog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.OrganizerDialog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.OrganizerDialog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.

Tekla.Structures.Dialog.UIControls.OrganizerDialog.closeButton
The closeButton closes the dialog.

Tekla.Structures.Dialog.UIControls.OrganizerDialog.listView
The listView contains items to be organized (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.button1
The button1 (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.button3
The button3 (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.button4
The button4 (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.instructionsLabel
The instructionsLabel contains intructions for the dialog (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.columnHeader1
The columnHeader1 (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.columnHeader2
The columnHeader2 (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.columnHeader3
The columnHeader3 (to be changed by the user).

Tekla.Structures.Dialog.UIControls.OrganizerDialog.contextMenuStrip1
The contextMenuStrip1 (to be changed by the user).